package com.example.interviewapplication.domain.models

data class CurrencyModel(
        val cutName: String,
        val value: Double,
        var fullNameOnRussian: String = "Неизвестная валюта"
) {

    init {
        fullNameOnRussian = when (cutName) {
                "USD" -> "Американский доллар"
                "SGD" -> "Сингапурский доллар"
                "SGD" -> "Сингапурский доллар"
                "AUD" -> "Австралийский доллар"
                "ILS" -> "Израильский шекель"
                "KRW" -> "Южнокорейская вона"
                "PLN" -> "Польский злотый"
                "MXN" -> "Мексиканское песо"
                "ZAR" -> "ЮАР'ский рэнд"
                "NZD" -> "Новозеландский доллар"
                "NOK" -> "Норвежская крона"
                "CNY" -> "Китайский юань"
                "TRY" -> "Турецкая лира"
                "BGN" -> "Болгарский лев"
                "MYR" -> "Малайзийский ринггит"
                "EUR" -> "Евро"
                "CHF" -> "Швейцарский франк"
                "THB" -> "Таиландский бат"
                "JPY" -> "Японская иена"
                "HRK" -> "Хорватская куна"
                "RUB" -> "Российский рубль"
                "BRL" -> "Бразильский реал"
                "INR" -> "Индийская рупия"
                "IDR" -> "Индонезийская рупия"
                "SEK" -> "Шведская крона"
                "RON" -> "Румынский лей"
                "GBP" -> "Британский фунт"
                "CZK" -> "Чешская крона"
                "HUF" -> "Венгерский форинт"
                "DKK" -> "Датская крона"
                "PHP" -> "Филиппинское песо"
                "ISK" -> "Исландская крона"
                "HKD" -> "Гонконгский доллар"
                "CAD" -> "Канадский доллар"
            else -> "Неизвестная валюта"
        }
    }
}